Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateOpening Property
 Cannot create opening.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateOpening { get; }
Public Shared ReadOnly Property CannotCreateOpening As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateOpening {
	FailureDefinitionId^ get ();
}
static member CannotCreateOpening : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace